app/views/todos/_form.html.erb

        <br>
        <%= f.select :user_id, User.all.ids, selected: User.last.id %>
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]