app/views/todos/index.html.erb

            Description: <%= todo.description %>
            <% if todo.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]