app/views/todos/show.html.erb


<% if @todo.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]