app/controllers/todos_controller.rb

SELECT "users"."id" FROM "users"
---
    def new
        @todo = Todo.new
        @user = User.all

INSERT INTO "todos" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Day 4"], ["description", "Completing Rails Todo App."], ["created_at", "2023-03-23 06:57:07.105016"], ["updated_at", "2023-03-23 06:57:07.105016"], ["user_id", 6]]
---
    def create
        @todo = Todo.create(todo_params)

UPDATE "todos" SET "updated_at" = ?, "user_id" = ? WHERE "todos"."id" = ?  [["updated_at", "2023-03-23 06:59:09.425568"], ["user_id", 7], ["id", 59]]
---
    def update
        if @todo.update(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 7]]
---
    def destroy
        @todo = Todo.find(params[:id])
        if @todo.destroy

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_todo
        @todo = Todo.find(params[:id])