app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 55], ["LIMIT", 1]]
---
    def edit
        @todo = Todo.find(params[:id])